Podkova/src/DataProcessors/Шиномонтаж/Шиномонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Шиномонтаж</name>
  <attributes>
    <name>Бригадир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Podkova/src/Catalogs/ШМ_ПинКоды/ШМ_ПинКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШМ_ПинКоды</name>
  <attributes>
    <name>Пин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Podkova/src/DataProcessors/Шиномонтаж/Forms/Пин/Module.bsl
&НаКлиенте
Процедура СобытиеНажатиеКнопки(Команда)
	Пин = Пин + СокрЛП(ТекущийЭлемент.Заголовок);
	Если СтрДлина(Пин) = 4 Тогда
		ПроверитьПин(Пин);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Бригадир) Тогда
		ПараметрыФормы = Новый Структура("Бригадир", Объект.Бригадир);
		ОткрытьФорму("Обработка.Шиномонтаж.Форма.Бригада",ПараметрыФормы);
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьПин(Пин)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_ПинКоды.Сотрудник
		|ИЗ
		|	Справочник.ШМ_ПинКоды КАК ШМ_ПинКоды
		|ГДЕ
		|	ШМ_ПинКоды.Пин = &Пин";
	
	Запрос.УстановитьПараметр("Пин", Пин);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Бригадир = Выборка.Сотрудник;
	Иначе
		Сообщить("Неверный ПИН");
		Пин = "";
	КонецЕсли;
КонецПроцедуры
